export const EntryMap = {
    1: {
        1: [1, 2, 4, 7, 8, 9, 10, 11],
        2: [2, 5, 9, 10],
        3: [1, 2, 4, 7, 8, 9, 10, 11],
        4: [3, 5, 6, 9, 10, 11, 12],
        5: [5, 6, 9, 11],
        6: [5, 6, 11],
        7: [1, 2, 4, 7, 8, 9, 10, 11],
        8: [3, 4, 6, 10, 11, 12],
        total: 48
    },
    2: {
        1: [3, 6, 7, 8, 10, 11],
        2: [1, 3, 6, 7, 10, 11],
        3: [2, 3, 5, 6, 9, 10, 11],
        4: [1, 3, 4, 5, 7, 8, 10, 11],
        5: [1, 4, 7, 8, 10, 11, 12],
        6: [3, 4, 5, 7, 9, 10, 11],
        7: [3, 5, 6, 11],
        8: [3, 6, 10, 11],
        total: 49,
    },
    3: {
        1: [3, 5, 6, 10, 11],
        2: [3, 6, 11],
        3: [1, 2, 4, 5, 6, 8, 9],
        4: [3, 5, 6, 11],
        5: [6, 10, 11, 12],
        6: [6, 8, 11, 12],
        7: [1, 4, 7, 8, 9, 10, 11],
        8: [1, 3, 6, 10, 11],
        total: 39
    },
    4: {
        1: [5, 6, 9, 11, 12],
        2: [2, 4, 6, 8, 10, 11],
        3: [1, 2, 4, 7, 8, 9, 10, 11],
        4: [1, 3, 5, 6, 9, 10, 11, 12],
        5: [6, 8, 11, 12],
        6: [1, 2, 3, 4, 5, 8, 9, 11],
        7: [1, 2, 4, 7, 8, 9, 10, 11],
        8: [1, 2, 4, 6, 8, 10, 11],
        total: 54
    },
    5: {
        1: [1, 2, 3, 4, 7, 8, 9, 10, 11],
        2: [2, 5, 7, 9, 11],
        3: [1, 2, 4, 7, 8, 10, 11],
        4: [1, 2, 4, 5, 6, 9, 10, 11],
        5: [1, 2, 3, 4, 7, 8, 10, 11],
        6: [2, 5, 6, 9, 10, 11],
        7: [3, 5, 6, 12],
        8: [1, 2, 4, 5, 6, 7, 9, 10, 11],
        total: 56
    },
    6: {
        1: [1, 9, 12],
        2: [1, 2, 3, 4, 5, 8, 9, 11, 12],
        3: [3, 5, 6, 9, 11, 12],
        4: [6, 9, 10, 11, 12],
        5: [5, 8, 9, 10, 11],
        6: [1, 2, 3, 4, 5, 8, 9, 10, 11],
        7: [3, 4, 5, 8, 9, 10, 11],
        8: [1, 2, 3, 4, 5, 8, 9, 11],
        total: 52
    },
    7: {
        1: [3, 4, 6, 7, 9, 10, 11],
        2: [3, 6, 11],
        3: [3, 5, 6, 10, 11, 12],
        4: [6, 8, 9, 10, 11, 12],
        5: [5, 6, 11, 12],
        6: [6, 11, 12],
        7: [3, 5, 6, 11],
        8: [1, 3, 4, 6, 10, 11],
        total: 39
    }
}
export const godToNumberMap = {
    'சூரி': 1,
    'சந்': 2,
    'செவ்': 3,
    'புத': 4,
    'குரு': 5,
    'சுக்': 6,
    'சனி': 7,
    'லக்': 8,
    'ராகு': 9,
    'கேது': 10
}

export const numberToGodMap = Object.keys(godToNumberMap).reduce((ret, key) => {
    ret[godToNumberMap[key]] = key
    return ret;
}, {});

export const transitionDayMap = {
    1: {
        box: 1,
        move: 30,
        till: new Date("2024-05-14"),
    },
    2: {
        box: 3,
        move: 2.25,
        till: new Date("2024-04-16"),
    },
    3: {
        box: 11,
        move: 45,
        till: new Date("2024-04-23")
    },
    4: {
        box: 12,
        move: 30,
        till: new Date("2024-05-10")
    },
    5: {
        box: 1,
        move: 365,
        till: new Date("2024-05-01")
    },
    6: {
        box: 12,
        move: 30,
        till: new Date("2024-04-24")
    },
    7: {
        box: 11,
        move: 2.5 * 365,
        till: new Date("2025-03-29")
    },
    9: {
        box: 12,
        move: 1.5 * 365,
        till: new Date('2025-05-25'),
    },
    10: {
        box: 6,
        move: 1.5 * 365,
        till: new Date('2025-05-25'),
    }

}
export const GOD_COUNT = 8;
export const RASI_COUNT = 12
export const outputEntries = Object.keys(EntryMap)

export const SUPER_GOD = {
    positions: {
        1: 3,
        2: 3,
        4: 3,
        7: 5,
        8: 6,
        12: 1,
    },
    god: {
        'சூரி': 2,
        'செவ்': 4,
        'சனி': 3,
        'ராகு': 1
    },
    lookFor: ['லக்', 'சந்', 'சுக்']
}

export const THIRI_SUNIYAM = {
    1: {name: "பிரதமை", value: "துலாம்,மகரம்"},
    2: {name: "துவிதியை", value: "தனுசு,மீனம்"},
    3: {name: "திருதியை", value: "சிம்மம்,மகரம்"},
    4: {name: "சதுர்த்தி", value: "ரிஷபம்,கும்பம்"},
    5: {name: "பஞ்சமி", value: "மிதுனம்,கன்னி"},
    6: {name: "சஷ்டி", value: "மேஷம்,சிம்மம்"},
    7: {name: "சப்தமி", value: "கடகம்,தனுசு"},
    8: {name: "அஷ்டமி", value: "மிதுனம்,கன்னி"},
    9: {name: "நவமி,தசமி", value: "சிம்மம்,விருச்சிகம்"},
    10: {name: "ஏகாதசி", value: "தனுசு,மீனம்"},
    11: {name: "துவாதசி", value: "துலாம்,மகரம்"},
    12: {name: "திரயோதசி", value: "ரிஷபம்,சிம்மம்"},
    13: {name: "சதுர்த்தசி", value: "மிதுனம்,கன்னி,தனுசு,மீனம்"}
}

export const MUDAKU_NACHATRAM = {
    1:	"அசுவினி - கேது",
    2:	"பரணி - சுக்கிரன்",
    3:	"கிருத்திகை - சூரியன்",
    4:	"உரோகிணி - சந்திரன்",
    5:	"மிருகசீரிடம் - செவ்வாய்",
    6:	"திருவாதிரை - இராகு",
    7:	"புனர்பூசம் - குரு (வியாழன்)",
    8:	"பூசம் - சனி",
    9:	"ஆயில்யம் - புதன்",
    10:	"மகம் - கேது",
    11:	"பூரம் - சுக்கிரன்",
    12:	"உத்திரம் - சூரியன்",
    13:	"அசுதம் - சந்திரன்",
    14:	"சித்திரை - செவ்வாய்",
    15:	"சுவாதி - இராகு",
    16:	"விசாகம் - குரு (வியாழன்)",
    17:	"அனுடம் - சனி",
    18:	"கேட்டை - புதன்",
    19:	"மூலம் - கேது",
    20:	"பூராடம் - சுக்கிரன்",
    21:	"உத்திராடம் - சூரியன்",
    22:	"திருவோணம் - சந்திரன்",
    23:	"அவிட்டம் - செவ்வாய்",
    24:	"சதயம் - இராகு",
    25:	"பூரட்டாதி - குரு (வியாழன்)",
    26:	"உத்திரட்டாதி - சனி",
    27:	"ரேவதி- புதன்"
}